Импорт данных/DataProcessors/ДанныеПоОстаткам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ДанныеПоОстаткам</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Импорт данных/AccumulationRegisters/КоличествоТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>КоличествоТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Импорт данных/DataProcessors/ДанныеПоОстаткам/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура РезультатНаСервере()
	ТЗ=ПереченьТоваров.Выгрузить();
	Запрос=Новый Запрос;
	Запрос.Текст= "ВЫБРАТЬ
	              |	ТЗ.Товар КАК Товар,
	              |	ТЗ.Количество КАК Количество
	              |ПОМЕСТИТЬ ВТ_ТоварыДокумента
	              |ИЗ
	              |	&ТЗ КАК ТЗ
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	ВТ_ТоварыДокумента.Товар КАК Товар,
	              |	ВТ_ТоварыДокумента.Количество КАК Количество,
	              |	ЕСТЬNULL(КоличествоТоваровОстатки.КоличествоОстаток, 0) КАК Остаток,
	              |	ВЫБОР
	              |		КОГДА ЕСТЬNULL(КоличествоТоваровОстатки.КоличествоОстаток, 0) < ВТ_ТоварыДокумента.Количество
	              |			ТОГДА ЛОЖЬ
	              |		ИНАЧЕ ИСТИНА
	              |	КОНЕЦ КАК Проверка
	              |ИЗ
	              |	ВТ_ТоварыДокумента КАК ВТ_ТоварыДокумента
	              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.КоличествоТоваров.Остатки(&Период, Филиал = &Филиал) КАК КоличествоТоваровОстатки
	              |		ПО ВТ_ТоварыДокумента.Товар = КоличествоТоваровОстатки.Товар";
	Запрос.УстановитьПараметр("ТЗ", ТЗ);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Филиал", Филиал);
	Результат=Запрос.Выполнить();
	Выборка=Результат.Выгрузить();
	ПереченьТоваров.Загрузить(Выборка);
КонецПроцедуры

&НаКлиенте
Процедура Результат(Команда)
	РезультатНаСервере();
КонецПроцедуры
